% fdatool
%低通滤波器：orders:8 
%fs:10000
%fpass:1000
%fstop:3000
%量化8位数



%% 产生正弦波原始数据
% %=============设置系统参数==============%
% clear;clc;
% f1=1000;        %设置波形频率
% f2=2000;
% f3=1500;
% Fs = 10000; %采样频率决定了两个正弦波点之间的间隔      
% L = 4096; %采样点数    
% N=16;           %数据位宽
% %=============产生输入信号==============%
% t=0:1/Fs:(1/Fs)*(L-1);
% y1=sin(2*pi*f1*t);
% y2=sin(2*pi*f2*t);
% % y3=sin(2*pi*f3*t);
% % y4=y1+y2+y3;
% y4 = y1+y2;
% y_n=round(y4*(2^(N-2)-1));      %N比特量化）
% %=================画图==================%
% a=10;           %改变系数可以调整显示周期
% stem(t,y_n);
% axis([0 L/Fs/a -2^N 2^N]);      %显示
%=============写入外部文件==============%
%*********产生.data文件 用于FPGA仿真************%
Fs = 10000; 
N = 4096; %采样点数
N1 = 0 : 1/Fs : N/Fs-1/Fs;
s = sin(1000*2*pi*N1) + sin(3000*2*pi*N1) +sin(4000*2*pi*N1);
fidc = fopen('D:\FPGA_CIDW\FIR_test\sin2.txt','wt');  

for x = 1 : N

   fprintf(fidc,'%x\n',round((s(x)+2.12)*58));

end 

fclose(fidc); 
ss = round((s+2.12)*58);

coeff =[-0.03125,-0.0390625,0.0784125,0.2890625,0.3984375,0.2890625,0.078125,-0.0390625,-0.03125];
% coeff_q = [f8,f6,14,4a,66,4a,14,f6,f8];
% coeff_q = [248,246,20,74,102,74,20,246,248];%8位量化
coe=round(coeff*400)+20;
out_q =conv(ss,coe);%卷积滤波



%% 仿真
L = 4096;
Fs = 10000;
t=0:1/Fs:(1/Fs)*(L-1);
in =sin(1000*2*pi*t) + sin(3000*2*pi*t) + sin(4000*2*pi*t);
 
coeff =[-0.03125,-0.0390625,0.0784125,0.2890625,0.3984375,0.2890625,0.078125,-0.0390625,-0.03125];
 
out =conv(in,coeff);%卷积滤波
 
subplot(2,1,1);
plot(in);
xlabel('滤波前');

% axis([0 200 -33]);

subplot(2,1,2);
plot(out);
xlabel('滤波后');

% axis([100 200 -22]);

